# Задание №1

# Вспомните какие модули вы уже проходили на курсе.

# Создайте файл, в котором вы импортируете встроенные в модуль функции под псевдонимами.
#  (3-7 строк импорта).

#from Python.Homework.HW5.HW5_task4 import fibonacci as fi

#from Python.Homework.HW5.HW5_task1 import prime_number as pn

from random import randint as rnd



#print(*fi(10))

#print(*pn(10))

print(rnd(0,100))

