# Задание №1
# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.

a= 'Текст'

b = 2

c = 1.6

d = True

print (type(a), type(b), type(c), type(d), sep= '\t')