# Задание №6
# ✔ Выведите в консоль таблицу умножения
# от 2х2 до 9х10 как на школьной тетрадке.
# ✔ Таблицу создайте в виде однострочного
# генератора, где каждый элемент генератора —
# отдельный пример таблицы умножения.
# ✔ Для вывода результата используйте «принт»
# без перехода на новую строку.

list_mul = ('\n'.join('\t'.join(f'{b} x {a} = {a*b}\t' for b in range(2,6))  for a in range(2,11)))

print(*list_mul)